# EnergyAnalysisVerticalVoidThreshold Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisVerticalVoidThreshold Property
ParameterTypeId Class See Also
---
"Average Vertical Void Height Threshold"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisVerticalVoidThreshold { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisVerticalVoidThreshold As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisVerticalVoidThreshold {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace